<template lang="pug">
  .row
    .col-md-4
      ul.list-group
        li.list-group-item.list-group-item-action(@click="show('maps')") Карты
        li.list-group-item.list-group-item-action(@click="show('aboutFlight')") О полёте
        li.list-group-item.list-group-item-action(@click="show('entertainment')") Развлечения
        li.list-group-item.list-group-item-action(@click="show('settings')") Настройки
        li.list-group-item.list-group-item-action(@click="show('steward')") Вызов бортпроводника
    .col-md-8
      .card
        .card-header {{ title }}
        .card-block(v-html="body")

    section#start(data-title="Начало") Для начала выберите пункт в левом меню.

    section#maps(data-title="Карты")
      b Найти место
      p Чтобы отыскать необходимое Вам место, необходимо воспользоваться 2ГИС или Картыми Гугл. 2ГИС лучше всего поможет Вам ориентироваться по городу, в который Вы направляетесь. С помощью 2ГИС можно отыскать не. Только улицу, но и определеную организацию или магазин. Карты Гугл понадобятся Вам, если вы хотите ориентировать не только по городу назначения, но и проложить дальнейший маршрут. Также Карты Гугл помогут Вам определить Ваше текущее местоположение

      b Проложить маршрут
      p Чтобы проложить маршрут в городе назначения и его окрестностях, рекомендуем воспользоваться 2ГИС. Для начала необходимо отметить пункт отправления, а затем пункт прибытия. 2ГИС сам проложит необходимый маршрут. Для более продолжительных маршрутов советуем воспользоваться Картами Гугл. Вам так же необходимо отметить пункт отправления и пункт прибытия. Карты помогут Вам ориентироваться не только по городу, но и по всему миру.

      b Фотографии мест
      p Фотографии мест предлагают Вам фото тех мест, над которыми будет происходить полет. Если видимость хорошая, то Вы можете завести будильник. Будильник даст Вам сигнал, когда самолёт будет пролетать над этим местом.

    section#aboutFlight(data-title="О полёте")
      b Где я нахожусь?
      p О полёте позволяет Вам отслеживать пройденный маршрут. Положение самолета на картах указывает Вам количество пройденного пути, а также Ваше текущее положение.

      b Полная информация о полёте
      p Помимо Вашего текущего положения О полёте указывает Вам количество оставшегося времени до конца полёта. Эта информация отображается в левом верхнем углу в течение всего полёта. Также О полёте предоставляет Вам информацию о погоде в пункте прибытия.

    section#entertainment(data-title="Развлечения")
      b Выбор музыки
      p Чтобы выбрать необходимый альбом, трек или исполнителя выберите предложенный вариант. Если вы не можете найти необходимую музыку, Вы можете воспользоваться поиском.

      b Выбор фильма
      p Чтобы выбрать необходимый фильм выберите предложенный варианты. Если вы не можете найти необходимый фильм, Вы можете воспользоваться поиском.

      b Лента новостей
      p Вашему вниманию предоставляются текущие новости, которые регулярно обновляются. Чтобы подробнее ознакомиться с новостью, щёлкните на неё.

    section#settings(data-title="Настройки")
      b Выбор фона
      p Чтобы выбрать необходимый фон рабочей области, нажмите на картинке. Фон сразу же изменится и сохранится.

    section#steward(data-title="Вызов бортпроводника")
      b Вызов бортпроводника
      p Чтобы выбрать вызвать бортпроводника, нажмите на кнопку Бортпроводник.
</template>

<style scoped>
  .row {
    margin-top: 1rem;
    padding: 0 1rem;
  }
  section {
    display: none;
  }
</style>

<script>
  export default {
    mounted() {
      $('li.list-group-item.list-group-item-action').click(function () {
        $('li.list-group-item.list-group-item-action').removeClass('active');
        $(this).addClass('active');
      });
      this.currentId = 'start';
    },
    data: () => {
      return {
        currentId: null
      }
    },
    computed: {
      title: function() {
        return $(`section#${this.currentId}`).data('title');
      },
      body: function() {
        return $(`section#${this.currentId}`).html();
      }
    },
    methods: {
      show: function (id) { 
        this.currentId = id;
      }
    }
  }
</script>